app/controllers/records_controller.rb

  def index
    render_resources Record.page(params[:page])
---
SELECT "records".* FROM "records" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]

  def show
    render_resource Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 9999], ["LIMIT", 1]]

  def update
    record = Record.find(params[:id])
    record.update create_params
---
SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 188], ["LIMIT", 1]]
UPDATE "records" SET "amount" = $1, "note" = $2, "updated_at" = $3 WHERE "records"."id" = $4  [["amount", 999], ["note", "吃饭"], ["updated_at", "2020-09-18 15:21:10.991527"], ["id", 264]]

  def create
    render_resource Record.create create_params.merge user: current_user
---
INSERT INTO "records" ("amount", "category", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 10000], ["category", 0], ["note", "请客"], ["created_at", "2020-09-16 16:09:37.004952"], ["updated_at", "2020-09-16 16:09:37.004952"]]

  def destroy
    record = Record.find params[:id]
    head record.destroy ? :ok : :bad_request
---
SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
DELETE FROM "records" WHERE "records"."id" = $1  [["id", 27]]