app/controllers/taggings_controller.rb

  def create
    render_resource Tagging.create create_params
---
INSERT INTO "taggings" ("tag_id", "record_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 151], ["record_id", 150], ["created_at", "2020-09-18 16:07:53.694633"], ["updated_at", "2020-09-18 16:07:53.694633"]]

  def destroy
    tagging = Tagging.find params[:id]
    head tagging.destroy ? :ok : :bad_request
---
SELECT "taggings".* FROM "taggings" WHERE "taggings"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
DELETE FROM "taggings" WHERE "taggings"."id" = $1  [["id", 30]]

  def index
    render_resources Tagging.page(params[:page])
---
SELECT "taggings".* FROM "taggings" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def show
    render_resource Tagging.find(params[:id])
---
SELECT "taggings".* FROM "taggings" WHERE "taggings"."id" = $1 LIMIT $2  [["id", 129], ["LIMIT", 1]]