app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    render_resources Tag.page(params[:page])

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 9999], ["LIMIT", 1]]
---
  def show
    render_resource Tag.find(params[:id])

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2020-09-18 14:56:35.872746"], ["updated_at", "2020-09-18 14:56:35.872746"]]
---
  def create
    render_resource Tag.create create_params.merge user: current_user

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 102], ["LIMIT", 1]]
UPDATE "tags" SET "name" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["name", "new"], ["updated_at", "2020-09-18 15:16:25.867241"], ["id", 102]]
---
  def update
    tag = Tag.find(params[:id])
    tag.update create_params

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 10]]
---
  def destroy
    tag = Tag.find params[:id]
    head tag.destroy ? :ok : :bad_request