app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    user = User.new

    user.email = params[:email]
    user.password = params[:password]
    user.password_confirmation = params[:password_confirmation]

    if user.save