app/models/session.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "1@qq.com"], ["LIMIT", 1]]
---
  def check_email
    user = User.find_by_email email